[
    {
        "id": 1,
        "title": "First post of the whole project",
        "date": "2023.04.12",
        "text": "I have created this website where I will document the progress of the project, and I will strive to record every small and big milestone. This website running on vercel.com, and gets data from a selected github repository and displays it on the website.",
        "link": ""
    },
    {
        "id": 2,
        "title": "Rethink how this website works",
        "date": "2023-04-13",
        "text": "Removed the whole backend, and now I am using a simple json file to store these posts. I will probably use a database in the future, but for now this is good enough. Next step will be to create a python program wich will generate and update the json file.",
        "link": ""
    },
    {
        "id": 3,
        "title": "Stared to make a demo game",
        "date": "2023-04-15",
        "text": "Following a tutorial on youtube, I have started to make a simple game. This game will be used to test and try things out. Right now i'm only for the first part of the tutorial, but I will continue to work on it.",
        "link": "https://imgur.com/a/UqlPAny"
    },
    {
        "id": 4,
        "title": "Setting up requirements",
        "date": "2023-04-16",
        "text": "I have started setting up the requirements for the project by creating a GitHub repository and writing down the project requirements. Additionally, I have generated the storyline for the game.",
        "link": "shorturl.at/dDUZ2"
    },
    {
        "id": 5,
        "title": "I continued working on the demo game today.",
        "date": "2023-04-18",
        "text": "I experimented with camera controls and collision detection. I searched for a free-to-use tileset that will provide the game's graphics and used it to create a level. I spent 3 hours on it, only to realize at the end that I need to scale the tileset images. So I made some progress, but also learned a lot. To be continued.",
        "link": "https://imgur.com/a/v2g2Ysg"
    },
    {
        "id": 6,
        "title": "Slowly but surely",
        "date": "2023-04-29",
        "text": "I haven't had much time to work on the project recently, but I didn't have any school assignments or studying to do, so I spent some time on it before work. During today's session, I created the map in Tiled and imported it into the game. There are still some issues because I need to slice the tileset to be able to handle the objects properly.",
        "link": ""
    },
    {
        "id": 7,
        "title": "Smallest things makes the biggest problems",
        "date": "2023-05-01",
        "text": "Due to the operation of the program, I had to cut up the tileset into 64x64 pixel squares, so I created a Python code that sliced and named them for me. However, when I tried to load the images into the game, it displayed seemingly random images. I spent over an hour searching for the error until I found it. The -os.walk()- Python function traverses the directory and returns the path, but not in order, for example, it returned 210 after 21, instead of 22. I had thought of this last, so it took a lot of time, but fortunately, I managed to solve it with a little sorting method.",
        "link": "https://imgur.com/a/W1UhB2u"
    },
    {
        "id": 8,
        "title": "Buildings, player animations, create github repo",
        "date": "2023-05-11",
        "text": "I was sick last week, but now I'm back, and I have made some progress. I created a GitHub repository for the project and added the first version of the game to it. I also created a building layer in Tiled and made a small village. Furthermore, I added some animations to the player, including move, idle, and attack animations. However, there are a few bugs with the images because some corners became visible during the splitting process. I will fix it later. Additionally, I need to optimize any graphics-related items since there are many unnecessary files.",
        "link": "https://github.com/SzGabor1/pygame-ms"
    },
    {
        "id": 9,
        "title": "Basics of the weapon system",
        "date": "2023-05-23",
        "text": "Finally, there is some action. I've implemented the basics of the weapon system. The player can now attack with multiple weapons, but they need to collect the weapons before they can use them, which will be integrated with the inventory/quest system. I have added the images related to the player, and this is an awesome feature in pygame. Additionally, I have created a small video showcasing the progress, which you can see below.",
        "link": "https://youtu.be/T3w95BAEYhU"
    },
    {
        "id": 10,
        "title": "Enemies, attack animations, and more",
        "date": "2023-06-12",
        "text": "After a successful exam period, I am resuming development. Today, I implemented the enemy system. They have all the necessary basic functionalities: they move towards the player within a certain range and take damage from both the enemy and the player. From now on, my goal is to dedicate 6 hours a day to ensure successful progress.",
        "link": ""
    },
    {
        "id": 11,
        "title": "Particle effects",
        "date": "2023-06-13",
        "text": "I have implemented the particle effects today. When we knock down the grass, small leaves fall, various effects appear during battles, and also when the enemy dies. The tutorial I'm following is slowly coming to an end, and individual development is about to begin. I'm really excited about it! Check the video about the progression. ;)",
        "link": "https://youtu.be/DHseAKUt5q8"
    }
]