[
    {
        "id": 1,
        "title": "First post of the whole project",
        "date": "2023.04.12",
        "text": "I have created this website where I will document the progress of the project, and I will strive to record every small and big milestone. This website running on vercel.com, and gets data from a selected github repository and displays it on the website.",
        "link": ""
    },
    {
        "id": 2,
        "title": "Rethink how this website works",
        "date": "2023-04-13",
        "text": "Removed the whole backend, and now I am using a simple json file to store these posts. I will probably use a database in the future, but for now this is good enough. Next step will be to create a python program wich will generate and update the json file.",
        "link": ""
    },
    {
        "id": 3,
        "title": "Stared to make a demo game",
        "date": "2023-04-15",
        "text": "Following a tutorial on youtube, I have started to make a simple game. This game will be used to test and try things out. Right now i'm only for the first part of the tutorial, but I will continue to work on it.",
        "link": "https://imgur.com/a/UqlPAny"
    },
    {
        "id": 4,
        "title": "Setting up requirements",
        "date": "2023-04-16",
        "text": "I have started setting up the requirements for the project by creating a GitHub repository and writing down the project requirements. Additionally, I have generated the storyline for the game.",
        "link": "shorturl.at/dDUZ2"
    },
    {
        "id": 5,
        "title": "I continued working on the demo game today.",
        "date": "2023-04-16",
        "text": "I experimented with camera controls and collision detection. I searched for a free-to-use tileset that will provide the game's graphics and used it to create a level. I spent 3 hours on it, only to realize at the end that I need to scale the tileset images. So I made some progress, but also learned a lot. To be continued.",
        "link": "https://imgur.com/a/v2g2Ysg"
    }
]